app/Controllers/c_barang.php

    public function index()
    {
        $model = new BarangModel();
        $data['barang'] = $model->findAll();
---
SELECT *
FROM `barang`