app/Controllers/c_cart.php

    public function index()
    {
        $cart = session()->get('cart') ?? [];

        $barangModel = new BarangModel();
        $data['barang'] = [];

        foreach ($barangModel->findAll() as $barang) {
---
SELECT *
FROM `barang`

    public function add($id)
    {
        $barangModel = new BarangModel();
        $item = $barangModel->find($id);

        if ($item) {
            if ($item['stok'] === 0) {
                return redirect()->back()->with('error', 'Stok barang habis');
            }

            $cart = session()->get('cart') ?? [];

            if (isset($cart[$id])) {
                $cart[$id]['quantity']++;
            } else {
                $cart[$id] = [
                    'nama' => $item['nama'],
                    'harga' => $item['harga'],
                    'quantity' => 1,
                ];
            }

            $item['stok']--;
            $barangModel->update($id, ['stok' => $item['stok']]);
---
SELECT *
FROM `barang`
WHERE `barang`.`id` = '2'
UPDATE `barang` SET `stok` = 49, `updated_at` = '2024-05-17 10:38:51'
WHERE `barang`.`id` IN ('2')